In [1]:
# Import dependencies
import pandas as pd

In [2]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [3]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)

In [4]:
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [5]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [6]:
school_df = pd.DataFrame(high_school_dicts)

In [7]:
school_df

   School ID      type            school_name
0          0  District                    NaN
1          1  District   Figueroa High School
2          2   Charter    Shelton High School
3          3  District  Hernandez High School
4          4   Charter    Griffin High School

In [8]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [9]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [10]:
schools_df

Empty DataFrame
Columns: []
Index: []

In [11]:
schools_df["School ID"] = school_id

In [12]:
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [13]:
schools_df["School Name"] = school_name

In [14]:
schools_df

   School ID            School Name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [15]:
schools_df["Type"] = type_of_school

In [16]:
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [17]:
high_schools_dict = {'School ID': school_id,'School Name': school_name,'School Type':type_of_school}

In [18]:
high_schools_dict

{'School ID': [0, 1, 2, 3, 4],
 'School Name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School'],
 'School Type': ['District', 'District', 'Charter', 'District', 'Charter']}

In [19]:
hsddf = pd.DataFrame(high_schools_dict)

In [20]:
hsddf

   School ID            School Name School Type
0          0      Huang High School    District
1          1   Figueroa High School    District
2          2    Shelton High School     Charter
3          3  Hernandez High School    District
4          4    Griffin High School     Charter

In [21]:
school_df.columns

Index(['School ID', 'type', 'school_name'], dtype='object')

In [22]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
school_df.values

array([[0, 'District', nan],
       [1, 'District', 'Figueroa High School'],
       [2, 'Charter', 'Shelton High School'],
       [3, 'District', 'Hernandez High School'],
       [4, 'Charter', 'Griffin High School']], dtype=object)

In [24]:
school_id = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
school_name = ["Zero", "One","Two","Three","Four","Five","Six","Seven","Eight","Nine","Ten","Eleven","Twelve","Thirteen","Fourteen"]
school_type = ["District","Charter","Charter","District","District","Charter","Charter","District","District","Charter","District","District","District","District","Charter"]

In [25]:
new_df = pd.DataFrame()

In [26]:
new_df['School ID'] = school_id
new_df['School Name'] = school_name
new_df['School Type'] = school_type

In [27]:
new_df

    School ID School Name School Type
0           0        Zero    District
1           1         One     Charter
2           2         Two     Charter
3           3       Three    District
4           4        Four    District
5           5        Five     Charter
6           6         Six     Charter
7           7       Seven    District
8           8       Eight    District
9           9        Nine     Charter
10         10         Ten    District
11         11      Eleven    District
12         12      Twelve    District
13         13    Thirteen    District
14         14    Fourteen     Charter

In [29]:
schools_df = pd.read_csv("Resources/schools_complete.csv")
students_df = pd.read_csv("Resources/students_complete.csv")

In [30]:
schools_df.index

RangeIndex(start=0, stop=15, step=1)

In [32]:
schools_df.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [ ]:
students